proyecto_RodriguezAntorena_Soto/app/Controllers/ProductosController.php

public function gestionar_productos() {
    $verificar = $this->verificarSesion(1); // 1 = admin
    if ($verificar) return $verificar;

    $productos_Model = new Productos_Model();
    $categoria_Model = new Categoria_Model();
    $request = \Config\Services::request();

    // Capturar filtros desde el formulario GET
    $nombreProd = $request->getGet('nombreProd');
    $categoriaId = $request->getGet('categoria');

    $productos_Model->join('categoria_productos', 'categoria_productos.id_categoria = productos.producto_categoria');

    // Aplicar filtros solo si se ingresaron
    if (!empty($nombreProd)) {
        $productos_Model->like('nombre_producto', $nombreProd); // búsqueda parcial
    }

    if (!empty($categoriaId)) {
        $productos_Model->where('producto_categoria', $categoriaId);
    }

    // Obtener productos filtrados
    $data['producto'] = $productos_Model->findAll();
---
SELECT *
FROM `categoria_productos`
SELECT *
FROM `productos`
JOIN `categoria_productos` ON `categoria_productos`.`id_categoria` = `productos`.`producto_categoria`