proyecto_RodriguezAntorena_Soto/app/Controllers/UsuarioController.php

SELECT *
FROM `consultas`
---
public function listar_consultas()
{
    $consulta_Model = new Consulta_Model();
    $request = \Config\Services::request();

    $fecha = $request->getGet('fecha'); // toma el valor del buscador

    if ($fecha) {
        $data['consulta'] = $consulta_Model->where('fecha_consultas', $fecha)->findAll();
    } else {
        $data['consulta'] = $consulta_Model->findAll();