proyecto_RodriguezAntorena_Soto/app/Controllers/VentasController.php

public function detalle_venta($id_venta)
{
    $perfil_id = session('perfil_id');

    // Solo ejecuta la verificación si es admin!!
    if ($perfil_id == 1) {
        $verificar = $this->verificarSesion(1);
        if ($verificar) return $verificar;
    }

    $detalleModel = new Detalle_venta_Model();
    $ventaModel = new Venta_Model();

    $venta = $ventaModel->find($id_venta);

    $detalles = $detalleModel->select('detalle_ventas.*, productos.nombre_producto')->join('productos', 'productos.id_producto = detalle_ventas.productos_id')->where('venta_id', $id_venta)->findAll();
---
SELECT *
FROM `ventas`
WHERE `ventas`.`id_venta` = '17'
SELECT `detalle_ventas`.*, `productos`.`nombre_producto`
FROM `detalle_ventas`
JOIN `productos` ON `productos`.`id_producto` = `detalle_ventas`.`productos_id`
WHERE `venta_id` = '17'